// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
// [3 7 22 2 78] -> 76


Console.WriteLine("Введите размер массива");
int size = Convert.ToInt32(Console.ReadLine());
double[] numbers = new double[size];
array(numbers);
Console.WriteLine("Массив: ");
PrintArray(numbers);
double min = Int32.MaxValue;
double max = Int32.MinValue;

for(int i=0; i<numbers.Length; i++)
{
    if (numbers[i]> max)
    {
        max=numbers[i];
    }
    {
        min=numbers[i];
    }
}
Console.WriteLine($"Максимальное значение {max}");
Console.WriteLine($"Минимальное значение {min}");
Console.WriteLine($"Разница между максимальным и минимальным элементов массива = {max-min}");

void array(double[] numbers)
{
    for(int i = 0; i < numbers.Length; i++)
    {
        numbers[i] = Convert.ToDouble(new Random().Next(100,1000)) / 100;
    }
}

void PrintArray(double[] numbers)
{
    Console.Write("[ ");
    for(int i = 0; i < numbers.Length; i++)
    {
        Console.Write(numbers[i] + " ");
    }
    Console.Write("]");
    Console.WriteLine();
}