// Console.WriteLine("Input number:");
// int num =Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"You imput {num} number");

//Вывод квадрата.

// Console.WriteLine("Input number:");
// int num =Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"Quad of{num} ->{num*num}");

// Является ли первое число квадратом второго?

// Console.WriteLine("Input first number:");
// int num1 =Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input second number:");
// int num2 =Convert.ToInt32(Console.ReadLine());

// if (num1==num2*num2)
// {
//     Console.WriteLine($"{num1} является квадратом {num2}");
// }
// else
// {
//     Console.WriteLine($"{num1} не является квадратом {num2}");
// }
  
  
  
 //Напишите программу которая принимает на вход число n а на выходе получаем строчку от -n до n
// На вход принимаем трехзначное сисло, вывести последнюю цифру данного числа.



